garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1769.PIC
        <edc:AdjustPoint edc:offset="2" edc:_addr="0x28F"/>
        <edc:JoinedSFRDef edc:cname="CCPR1" edc:desc="" edc:name="CCPR1" edc:nzwidth="0x10" edc:_modsrc="DOS-02493_ccp_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x291">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR1L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR1L" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02493_ccp_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x291">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="RL" edc:desc="" edc:mask="0xff" edc:name="RL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR1H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR1H" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02493_ccp_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x292">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="RH" edc:desc="" edc:mask="0xff" edc:name="RH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="n-rnnnnn" edc:cname="CCP1CON" edc:desc="" edc:impl="0xbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-000000" edc:name="CCP1CON" edc:nzwidth="8" edc:por="0-000000" edc:_modsrc="DOS-02493_ccp_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x293">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0xf" edc:name="MODE" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="FMT" edc:desc="" edc:mask="0x1" edc:name="FMT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:desc="" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE3" edc:desc="" edc:mask="0x1" edc:name="MODE3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP1MODE" edc:desc="" edc:mask="0xf" edc:name="CCP1MODE" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="CCP1FMT" edc:desc="" edc:mask="0x1" edc:name="CCP1FMT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1OUT" edc:desc="" edc:mask="0x1" edc:name="CCP1OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CCP1EN" edc:desc="" edc:mask="0x1" edc:name="CCP1EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CCP1MODE0" edc:desc="" edc:mask="0x1" edc:name="CCP1MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1MODE1" edc:desc="" edc:mask="0x1" edc:name="CCP1MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1MODE2" edc:desc="" edc:mask="0x1" edc:name="CCP1MODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1MODE3" edc:desc="" edc:mask="0x1" edc:name="CCP1MODE3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="CCP1CAP" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="CCP1CAP" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-02493_ccp_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x294">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CTS" edc:desc="" edc:mask="0x7" edc:name="CTS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="CTS0" edc:desc="" edc:mask="0x1" edc:name="CTS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTS1" edc:desc="" edc:mask="0x1" edc:name="CTS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTS2" edc:desc="" edc:mask="0x1" edc:name="CTS2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP1CTS" edc:desc="" edc:mask="0x7" edc:name="CCP1CTS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CCP1CTS0" edc:desc="" edc:mask="0x1" edc:name="CCP1CTS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1CTS1" edc:desc="" edc:mask="0x1" edc:name="CCP1CTS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1CTS2" edc:desc="" edc:mask="0x1" edc:name="CCP1CTS2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="3" edc:_addr="0x295"/>
        <edc:JoinedSFRDef edc:cname="CCPR2" edc:desc="" edc:name="CCPR2" edc:nzwidth="0x10" edc:_modsrc="DOS-02493_ccp_v4.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x298">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR2L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR2L" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02493_ccp_v4.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x298">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="RL" edc:desc="" edc:mask="0xff" edc:name="RL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR2H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR2H" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02493_ccp_v4.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x299">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="RH" edc:desc="" edc:mask="0xff" edc:name="RH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="n-rnnnnn" edc:cname="CCP2CON" edc:desc="" edc:impl="0xbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-000000" edc:name="CCP2CON" edc:nzwidth="8" edc:por="0-000000" edc:_modsrc="DOS-02493_ccp_v4.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x29A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0xf" edc:name="MODE" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="FMT" edc:desc="" edc:mask="0x1" edc:name="FMT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:desc="" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE3" edc:desc="" edc:mask="0x1" edc:name="MODE3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP2MODE" edc:desc="" edc:mask="0xf" edc:name="CCP2MODE" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="CCP2FMT" edc:desc="" edc:mask="0x1" edc:name="CCP2FMT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2OUT" edc:desc="" edc:mask="0x1" edc:name="CCP2OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CCP2EN" edc:desc="" edc:mask="0x1" edc:name="CCP2EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CCP2MODE0" edc:desc="" edc:mask="0x1" edc:name="CCP2MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2MODE1" edc:desc="" edc:mask="0x1" edc:name="CCP2MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2MODE2" edc:desc="" edc:mask="0x1" edc:name="CCP2MODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2MODE3" edc:desc="" edc:mask="0x1" edc:name="CCP2MODE3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="CCP2CAP" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="CCP2CAP" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-02493_ccp_v4.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x29B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CTS" edc:desc="" edc:mask="0x7" edc:name="CTS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="CTS0" edc:desc="" edc:mask="0x1" edc:name="CTS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTS1" edc:desc="" edc:mask="0x1" edc:name="CTS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTS2" edc:desc="" edc:mask="0x1" edc:name="CTS2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP2CTS" edc:desc="" edc:mask="0x7" edc:name="CCP2CTS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CCP2CTS0" edc:desc="" edc:mask="0x1" edc:name="CCP2CTS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2CTS1" edc:desc="" edc:mask="0x1" edc:name="CCP2CTS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2CTS2" edc:desc="" edc:mask="0x1" edc:name="CCP2CTS2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2" edc:_addr="0x29C"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPTMRS" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CCPTMRS" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x29E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C1TSEL" edc:desc="" edc:mask="0x3" edc:name="C1TSEL" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="C2TSEL" edc:desc="" edc:mask="0x3" edc:name="C2TSEL" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="P3TSEL" edc:desc="" edc:mask="0x3" edc:name="P3TSEL" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="P4TSEL" edc:desc="" edc:mask="0x3" edc:name="P4TSEL" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C1TSEL0" edc:desc="" edc:mask="0x1" edc:name="C1TSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1TSEL1" edc:desc="" edc:mask="0x1" edc:name="C1TSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2TSEL0" edc:desc="" edc:mask="0x1" edc:name="C2TSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2TSEL1" edc:desc="" edc:mask="0x1" edc:name="C2TSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P3TSEL0" edc:desc="" edc:mask="0x1" edc:name="P3TSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P3TSEL1" edc:desc="" edc:mask="0x1" edc:name="P3TSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P4TSEL0" edc:desc="" edc:mask="0x1" edc:name="P4TSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P4TSEL1" edc:desc="" edc:mask="0x1" edc:name="P4TSEL1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="6" edc:beginaddr="0x300" edc:endaddr="0x320" edc:regionid="sfr6">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x300"/>
        <edc:SFRDef edc:access="--nn-nnn" edc:cname="SLRCONA" edc:desc="" edc:impl="0x37" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--11-111" edc:name="SLRCONA" edc:nzwidth="8" edc:por="--11-111" edc:_addr="0x30C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SLRA0" edc:desc="" edc:mask="0x1" edc:name="SLRA0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRA1" edc:desc="" edc:mask="0x1" edc:name="SLRA1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRA2" edc:desc="" edc:mask="0x1" edc:name="SLRA2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SLRA4" edc:desc="" edc:mask="0x1" edc:name="SLRA4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRA5" edc:desc="" edc:mask="0x1" edc:name="SLRA5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn----" edc:cname="SLRCONB" edc:desc="" edc:impl="0xf0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1111----" edc:name="SLRCONB" edc:nzwidth="8" edc:por="1111----" edc:_addr="0x30D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="SLRB4" edc:desc="" edc:mask="0x1" edc:name="SLRB4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRB5" edc:desc="" edc:mask="0x1" edc:name="SLRB5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRB6" edc:desc="" edc:mask="0x1" edc:name="SLRB6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRB7" edc:desc="" edc:mask="0x1" edc:name="SLRB7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SLRCONC" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="SLRCONC" edc:nzwidth="8" edc:por="11111111" edc:_addr="0x30E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SLRC0" edc:desc="" edc:mask="0x1" edc:name="SLRC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRC1" edc:desc="" edc:mask="0x1" edc:name="SLRC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRC2" edc:desc="" edc:mask="0x1" edc:name="SLRC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRC3" edc:desc="" edc:mask="0x1" edc:name="SLRC3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRC4" edc:desc="" edc:mask="0x1" edc:name="SLRC4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRC5" edc:desc="" edc:mask="0x1" edc:name="SLRC5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRC6" edc:desc="" edc:mask="0x1" edc:name="SLRC6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRC7" edc:desc="" edc:mask="0x1" edc:name="SLRC7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="12" edc:_addr="0x30F"/>
        <edc:SFRDef edc:access="n-rn---n" edc:cname="MD2CON0" edc:desc="" edc:impl="0xb1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-00---0" edc:name="MD2CON0" edc:nzwidth="8" edc:por="0-00---0" edc:_modsrc="DOS-02566_txm_mod_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x31B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BIT" edc:desc="" edc:mask="0x1" edc:name="BIT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="OPOL" edc:desc="" edc:mask="0x1" edc:name="OPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MD2BIT" edc:desc="" edc:mask="0x1" edc:name="MD2BIT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="MD2OPOL" edc:desc="" edc:mask="0x1" edc:name="MD2OPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD2OUT" edc:desc="" edc:mask="0x1" edc:name="MD2OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="MD2EN" edc:desc="" edc:mask="0x1" edc:name="MD2EN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nn--nn" edc:cname="MD2CON1" edc:desc="" edc:impl="0x33" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--00--00" edc:name="MD2CON1" edc:nzwidth="8" edc:por="--00--00" edc:_modsrc="DOS-02566_txm_mod_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x31C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLSYNC" edc:desc="" edc:mask="0x1" edc:name="CLSYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLPOL" edc:desc="" edc:mask="0x1" edc:name="CLPOL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="CHSYNC" edc:desc="" edc:mask="0x1" edc:name="CHSYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHPOL" edc:desc="" edc:mask="0x1" edc:name="CHPOL" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MD2CLSYNC" edc:desc="" edc:mask="0x1" edc:name="MD2CLSYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD2CLPOL" edc:desc="" edc:mask="0x1" edc:name="MD2CLPOL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="MD2CHSYNC" edc:desc="" edc:mask="0x1" edc:name="MD2CHSYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD2CHPOL" edc:desc="" edc:mask="0x1" edc:name="MD2CHPOL" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="MD2SRC" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="MD2SRC" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-02566_txm_mod_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x31D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MS" edc:desc="" edc:mask="0x1f" edc:name="MS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="MS0" edc:desc="" edc:mask="0x1" edc:name="MS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MS1" edc:desc="" edc:mask="0x1" edc:name="MS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MS2" edc:desc="" edc:mask="0x1" edc:name="MS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MS3" edc:desc="" edc:mask="0x1" edc:name="MS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MS4" edc:desc="" edc:mask="0x1" edc:name="MS4" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MD2MS" edc:desc="" edc:mask="0x1f" edc:name="MD2MS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="MD2MS0" edc:desc="" edc:mask="0x1" edc:name="MD2MS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD2MS1" edc:desc="" edc:mask="0x1" edc:name="MD2MS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD2MS2" edc:desc="" edc:mask="0x1" edc:name="MD2MS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD2MS3" edc:desc="" edc:mask="0x1" edc:name="MD2MS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD2MS4" edc:desc="" edc:mask="0x1" edc:name="MD2MS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
