garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1769.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="IOCAF" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="IOCAF" edc:nzwidth="8" edc:por="--000000" edc:_addr="0x393">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCAF0" edc:desc="" edc:mask="0x1" edc:name="IOCAF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAF1" edc:desc="" edc:mask="0x1" edc:name="IOCAF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAF2" edc:desc="" edc:mask="0x1" edc:name="IOCAF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAF3" edc:desc="" edc:mask="0x1" edc:name="IOCAF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAF4" edc:desc="" edc:mask="0x1" edc:name="IOCAF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAF5" edc:desc="" edc:mask="0x1" edc:name="IOCAF5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn----" edc:cname="IOCBP" edc:desc="" edc:impl="0xf0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000----" edc:name="IOCBP" edc:nzwidth="8" edc:por="0000----" edc:_addr="0x394">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="IOCBP4" edc:desc="" edc:mask="0x1" edc:name="IOCBP4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBP5" edc:desc="" edc:mask="0x1" edc:name="IOCBP5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBP6" edc:desc="" edc:mask="0x1" edc:name="IOCBP6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBP7" edc:desc="" edc:mask="0x1" edc:name="IOCBP7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn----" edc:cname="IOCBN" edc:desc="" edc:impl="0xf0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000----" edc:name="IOCBN" edc:nzwidth="8" edc:por="0000----" edc:_addr="0x395">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="IOCBN4" edc:desc="" edc:mask="0x1" edc:name="IOCBN4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBN5" edc:desc="" edc:mask="0x1" edc:name="IOCBN5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBN6" edc:desc="" edc:mask="0x1" edc:name="IOCBN6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBN7" edc:desc="" edc:mask="0x1" edc:name="IOCBN7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn----" edc:cname="IOCBF" edc:desc="" edc:impl="0xf0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000----" edc:name="IOCBF" edc:nzwidth="8" edc:por="0000----" edc:_addr="0x396">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="IOCBF4" edc:desc="" edc:mask="0x1" edc:name="IOCBF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBF5" edc:desc="" edc:mask="0x1" edc:name="IOCBF5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBF6" edc:desc="" edc:mask="0x1" edc:name="IOCBF6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBF7" edc:desc="" edc:mask="0x1" edc:name="IOCBF7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCCP" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCCP" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x397">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCCP0" edc:desc="" edc:mask="0x1" edc:name="IOCCP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCP1" edc:desc="" edc:mask="0x1" edc:name="IOCCP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCP2" edc:desc="" edc:mask="0x1" edc:name="IOCCP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCP3" edc:desc="" edc:mask="0x1" edc:name="IOCCP3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCP4" edc:desc="" edc:mask="0x1" edc:name="IOCCP4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCP5" edc:desc="" edc:mask="0x1" edc:name="IOCCP5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCP6" edc:desc="" edc:mask="0x1" edc:name="IOCCP6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCP7" edc:desc="" edc:mask="0x1" edc:name="IOCCP7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCCN" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCCN" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x398">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCCN0" edc:desc="" edc:mask="0x1" edc:name="IOCCN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCN1" edc:desc="" edc:mask="0x1" edc:name="IOCCN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCN2" edc:desc="" edc:mask="0x1" edc:name="IOCCN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCN3" edc:desc="" edc:mask="0x1" edc:name="IOCCN3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCN4" edc:desc="" edc:mask="0x1" edc:name="IOCCN4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCN5" edc:desc="" edc:mask="0x1" edc:name="IOCCN5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCN6" edc:desc="" edc:mask="0x1" edc:name="IOCCN6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCN7" edc:desc="" edc:mask="0x1" edc:name="IOCCN7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCCF" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCCF" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x399">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCCF0" edc:desc="" edc:mask="0x1" edc:name="IOCCF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCF1" edc:desc="" edc:mask="0x1" edc:name="IOCCF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCF2" edc:desc="" edc:mask="0x1" edc:name="IOCCF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCF3" edc:desc="" edc:mask="0x1" edc:name="IOCCF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCF4" edc:desc="" edc:mask="0x1" edc:name="IOCCF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCF5" edc:desc="" edc:mask="0x1" edc:name="IOCCF5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCF6" edc:desc="" edc:mask="0x1" edc:name="IOCCF6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCF7" edc:desc="" edc:mask="0x1" edc:name="IOCCF7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
