garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1769.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG2DBR" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="COG2DBR" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x711">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DBR" edc:desc="" edc:mask="0x3f" edc:name="DBR" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="DBR0" edc:desc="" edc:mask="0x1" edc:name="DBR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR1" edc:desc="" edc:mask="0x1" edc:name="DBR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR2" edc:desc="" edc:mask="0x1" edc:name="DBR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR3" edc:desc="" edc:mask="0x1" edc:name="DBR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR4" edc:desc="" edc:mask="0x1" edc:name="DBR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR5" edc:desc="" edc:mask="0x1" edc:name="DBR5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G2DBR0" edc:desc="" edc:mask="0x1" edc:name="G2DBR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2DBR1" edc:desc="" edc:mask="0x1" edc:name="G2DBR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2DBR2" edc:desc="" edc:mask="0x1" edc:name="G2DBR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2DBR3" edc:desc="" edc:mask="0x1" edc:name="G2DBR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2DBR4" edc:desc="" edc:mask="0x1" edc:name="G2DBR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2DBR5" edc:desc="" edc:mask="0x1" edc:name="G2DBR5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG2DBF" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="COG2DBF" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x712">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DBF0" edc:desc="" edc:mask="0x1" edc:name="DBF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF1" edc:desc="" edc:mask="0x1" edc:name="DBF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF2" edc:desc="" edc:mask="0x1" edc:name="DBF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF3" edc:desc="" edc:mask="0x1" edc:name="DBF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF4" edc:desc="" edc:mask="0x1" edc:name="DBF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF5" edc:desc="" edc:mask="0x1" edc:name="DBF5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="G2DBF0" edc:desc="" edc:mask="0x1" edc:name="G2DBF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2DBF1" edc:desc="" edc:mask="0x1" edc:name="G2DBF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2DBF2" edc:desc="" edc:mask="0x1" edc:name="G2DBF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2DBF3" edc:desc="" edc:mask="0x1" edc:name="G2DBF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2DBF4" edc:desc="" edc:mask="0x1" edc:name="G2DBF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2DBF5" edc:desc="" edc:mask="0x1" edc:name="G2DBF5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G2DBF" edc:desc="" edc:mask="0x3f" edc:name="G2DBF" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn-nnnnn" edc:cname="COG2CON0" edc:desc="" edc:impl="0xdf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-00000" edc:name="COG2CON0" edc:nzwidth="0x8" edc:por="00-00000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x713">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MD" edc:desc="" edc:mask="0x7" edc:name="MD" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="CS" edc:desc="" edc:mask="0x3" edc:name="CS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LD" edc:desc="" edc:mask="0x1" edc:name="LD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="MD0" edc:desc="" edc:mask="0x1" edc:name="MD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD1" edc:desc="" edc:mask="0x1" edc:name="MD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD2" edc:desc="" edc:mask="0x1" edc:name="MD2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CS0" edc:desc="" edc:mask="0x1" edc:name="CS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CS1" edc:desc="" edc:mask="0x1" edc:name="CS1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G2MD" edc:desc="" edc:mask="0x7" edc:name="G2MD" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="G2CS" edc:desc="" edc:mask="0x3" edc:name="G2CS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="G2LD" edc:desc="" edc:mask="0x1" edc:name="G2LD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2EN" edc:desc="" edc:mask="0x1" edc:name="G2EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="G2MD0" edc:desc="" edc:mask="0x1" edc:name="G2MD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2MD1" edc:desc="" edc:mask="0x1" edc:name="G2MD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2MD2" edc:desc="" edc:mask="0x1" edc:name="G2MD2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2CS0" edc:desc="" edc:mask="0x1" edc:name="G2CS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2CS1" edc:desc="" edc:mask="0x1" edc:name="G2CS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn--nnnn" edc:cname="COG2CON1" edc:desc="" edc:impl="0xcf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00--0000" edc:name="COG2CON1" edc:nzwidth="8" edc:por="00--0000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x714">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POLA" edc:desc="" edc:mask="0x1" edc:name="POLA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="POLB" edc:desc="" edc:mask="0x1" edc:name="POLB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="POLC" edc:desc="" edc:mask="0x1" edc:name="POLC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="POLD" edc:desc="" edc:mask="0x1" edc:name="POLD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="FDBS" edc:desc="" edc:mask="0x1" edc:name="FDBS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RDBS" edc:desc="" edc:mask="0x1" edc:name="RDBS" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G2POLA" edc:desc="" edc:mask="0x1" edc:name="G2POLA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2POLB" edc:desc="" edc:mask="0x1" edc:name="G2POLB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2POLC" edc:desc="" edc:mask="0x1" edc:name="G2POLC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2POLD" edc:desc="" edc:mask="0x1" edc:name="G2POLD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="G2FDBS" edc:desc="" edc:mask="0x1" edc:name="G2FDBS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2RDBS" edc:desc="" edc:mask="0x1" edc:name="G2RDBS" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG2RIS0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG2RIS0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x715">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RIS0" edc:desc="" edc:mask="0x1" edc:name="RIS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS1" edc:desc="" edc:mask="0x1" edc:name="RIS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS2" edc:desc="" edc:mask="0x1" edc:name="RIS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS3" edc:desc="" edc:mask="0x1" edc:name="RIS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS4" edc:desc="" edc:mask="0x1" edc:name="RIS4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS5" edc:desc="" edc:mask="0x1" edc:name="RIS5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS6" edc:desc="" edc:mask="0x1" edc:name="RIS6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS7" edc:desc="" edc:mask="0x1" edc:name="RIS7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G2RIS0" edc:desc="" edc:mask="0x1" edc:name="G2RIS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2RIS1" edc:desc="" edc:mask="0x1" edc:name="G2RIS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2RIS2" edc:desc="" edc:mask="0x1" edc:name="G2RIS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2RIS3" edc:desc="" edc:mask="0x1" edc:name="G2RIS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2RIS4" edc:desc="" edc:mask="0x1" edc:name="G2RIS4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2RIS5" edc:desc="" edc:mask="0x1" edc:name="G2RIS5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2RIS6" edc:desc="" edc:mask="0x1" edc:name="G2RIS6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2RIS7" edc:desc="" edc:mask="0x1" edc:name="G2RIS7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG2RIS1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG2RIS1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x716">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RIS8" edc:desc="" edc:mask="0x1" edc:name="RIS8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS9" edc:desc="" edc:mask="0x1" edc:name="RIS9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS10" edc:desc="" edc:mask="0x1" edc:name="RIS10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS11" edc:desc="" edc:mask="0x1" edc:name="RIS11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS12" edc:desc="" edc:mask="0x1" edc:name="RIS12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS13" edc:desc="" edc:mask="0x1" edc:name="RIS13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS14" edc:desc="" edc:mask="0x1" edc:name="RIS14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS15" edc:desc="" edc:mask="0x1" edc:name="RIS15" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G2RIS8" edc:desc="" edc:mask="0x1" edc:name="G2RIS8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2RIS9" edc:desc="" edc:mask="0x1" edc:name="G2RIS9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2RIS10" edc:desc="" edc:mask="0x1" edc:name="G2RIS10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2RIS11" edc:desc="" edc:mask="0x1" edc:name="G2RIS11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2RIS12" edc:desc="" edc:mask="0x1" edc:name="G2RIS12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2RIS13" edc:desc="" edc:mask="0x1" edc:name="G2RIS13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2RIS14" edc:desc="" edc:mask="0x1" edc:name="G2RIS14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2RIS15" edc:desc="" edc:mask="0x1" edc:name="G2RIS15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG2RSIM0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG2RSIM0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x717">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RSIM0" edc:desc="" edc:mask="0x1" edc:name="RSIM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM1" edc:desc="" edc:mask="0x1" edc:name="RSIM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM2" edc:desc="" edc:mask="0x1" edc:name="RSIM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM3" edc:desc="" edc:mask="0x1" edc:name="RSIM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM4" edc:desc="" edc:mask="0x1" edc:name="RSIM4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM5" edc:desc="" edc:mask="0x1" edc:name="RSIM5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM6" edc:desc="" edc:mask="0x1" edc:name="RSIM6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM7" edc:desc="" edc:mask="0x1" edc:name="RSIM7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G2RSIM0" edc:desc="" edc:mask="0x1" edc:name="G2RSIM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2RSIM1" edc:desc="" edc:mask="0x1" edc:name="G2RSIM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2RSIM2" edc:desc="" edc:mask="0x1" edc:name="G2RSIM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2RSIM3" edc:desc="" edc:mask="0x1" edc:name="G2RSIM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2RSIM4" edc:desc="" edc:mask="0x1" edc:name="G2RSIM4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2RSIM5" edc:desc="" edc:mask="0x1" edc:name="G2RSIM5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2RSIM6" edc:desc="" edc:mask="0x1" edc:name="G2RSIM6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2RSIM7" edc:desc="" edc:mask="0x1" edc:name="G2RSIM7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG2RSIM1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG2RSIM1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x718">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RSIM8" edc:desc="" edc:mask="0x1" edc:name="RSIM8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM9" edc:desc="" edc:mask="0x1" edc:name="RSIM9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM10" edc:desc="" edc:mask="0x1" edc:name="RSIM10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM11" edc:desc="" edc:mask="0x1" edc:name="RSIM11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM12" edc:desc="" edc:mask="0x1" edc:name="RSIM12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM13" edc:desc="" edc:mask="0x1" edc:name="RSIM13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM14" edc:desc="" edc:mask="0x1" edc:name="RSIM14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM15" edc:desc="" edc:mask="0x1" edc:name="RSIM15" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G2RSIM8" edc:desc="" edc:mask="0x1" edc:name="G2RSIM8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2RSIM9" edc:desc="" edc:mask="0x1" edc:name="G2RSIM9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2RSIM10" edc:desc="" edc:mask="0x1" edc:name="G2RSIM10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2RSIM11" edc:desc="" edc:mask="0x1" edc:name="G2RSIM11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2RSIM12" edc:desc="" edc:mask="0x1" edc:name="G2RSIM12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2RSIM13" edc:desc="" edc:mask="0x1" edc:name="G2RSIM13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2RSIM14" edc:desc="" edc:mask="0x1" edc:name="G2RSIM14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2RSIM15" edc:desc="" edc:mask="0x1" edc:name="G2RSIM15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
