garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1769.PIC
        <edc:JoinedSFRDef edc:cname="PWM5OF" edc:desc="" edc:name="PWM5OF" edc:nzwidth="0x10" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xD97">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM5OFL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM5OFL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xD97">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="OF" edc:desc="" edc:mask="0xff" edc:name="OF" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM5OFL0" edc:desc="" edc:mask="0x1" edc:name="PWM5OFL0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5OFL1" edc:desc="" edc:mask="0x1" edc:name="PWM5OFL1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5OFL2" edc:desc="" edc:mask="0x1" edc:name="PWM5OFL2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5OFL3" edc:desc="" edc:mask="0x1" edc:name="PWM5OFL3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5OFL4" edc:desc="" edc:mask="0x1" edc:name="PWM5OFL4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5OFL5" edc:desc="" edc:mask="0x1" edc:name="PWM5OFL5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5OFL6" edc:desc="" edc:mask="0x1" edc:name="PWM5OFL6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5OFL7" edc:desc="" edc:mask="0x1" edc:name="PWM5OFL7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM5OFL" edc:desc="" edc:mask="0xff" edc:name="PWM5OFL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM5OFH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM5OFH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xD98">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="OF" edc:desc="" edc:mask="0xff" edc:name="OF" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM5OFH0" edc:desc="" edc:mask="0x1" edc:name="PWM5OFH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5OFH1" edc:desc="" edc:mask="0x1" edc:name="PWM5OFH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5OFH2" edc:desc="" edc:mask="0x1" edc:name="PWM5OFH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5OFH3" edc:desc="" edc:mask="0x1" edc:name="PWM5OFH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5OFH4" edc:desc="" edc:mask="0x1" edc:name="PWM5OFH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5OFH5" edc:desc="" edc:mask="0x1" edc:name="PWM5OFH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5OFH6" edc:desc="" edc:mask="0x1" edc:name="PWM5OFH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5OFH7" edc:desc="" edc:mask="0x1" edc:name="PWM5OFH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM5OFH" edc:desc="" edc:mask="0xff" edc:name="PWM5OFH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="PWM5TMR" edc:desc="" edc:name="PWM5TMR" edc:nzwidth="0x10" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xD99">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM5TMRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM5TMRL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xD99">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TMR" edc:desc="" edc:mask="0xff" edc:name="TMR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM5TMRL0" edc:desc="" edc:mask="0x1" edc:name="PWM5TMRL0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5TMRL1" edc:desc="" edc:mask="0x1" edc:name="PWM5TMRL1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5TMRL2" edc:desc="" edc:mask="0x1" edc:name="PWM5TMRL2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5TMRL3" edc:desc="" edc:mask="0x1" edc:name="PWM5TMRL3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5TMRL4" edc:desc="" edc:mask="0x1" edc:name="PWM5TMRL4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5TMRL5" edc:desc="" edc:mask="0x1" edc:name="PWM5TMRL5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5TMRL6" edc:desc="" edc:mask="0x1" edc:name="PWM5TMRL6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5TMRL7" edc:desc="" edc:mask="0x1" edc:name="PWM5TMRL7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM5TMRL" edc:desc="" edc:mask="0xff" edc:name="PWM5TMRL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM5TMRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM5TMRH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xD9A">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TMR" edc:desc="" edc:mask="0xff" edc:name="TMR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM5TMRH0" edc:desc="" edc:mask="0x1" edc:name="PWM5TMRH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5TMRH1" edc:desc="" edc:mask="0x1" edc:name="PWM5TMRH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5TMRH2" edc:desc="" edc:mask="0x1" edc:name="PWM5TMRH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5TMRH3" edc:desc="" edc:mask="0x1" edc:name="PWM5TMRH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5TMRH4" edc:desc="" edc:mask="0x1" edc:name="PWM5TMRH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5TMRH5" edc:desc="" edc:mask="0x1" edc:name="PWM5TMRH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5TMRH6" edc:desc="" edc:mask="0x1" edc:name="PWM5TMRH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM5TMRH7" edc:desc="" edc:mask="0x1" edc:name="PWM5TMRH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM5TMRH" edc:desc="" edc:mask="0xff" edc:name="PWM5TMRH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
